
Функция getDataGET(Запрос)
    
    Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 500
                          | Репозитории.Наименование КАК name,
                          | Репозитории.URL КАК url,
                          | Репозитории.Автор.URL КАК author,
                          | Репозитории.Описание КАК description,
                          | Репозитории.ДатаСоздания КАК createddate,
                          | Репозитории.Лицензия КАК license,
                          | СтатистикаРепозиториевСрезПоследних.Звезды КАК stars,
                          | СтатистикаРепозиториевСрезПоследних.Форки КАК forks,
                          | Репозитории.Автор.Аватар КАК pic,
                          | Репозитории.Язык КАК lang,
                          | Репозитории.Размер КАК size,
                          | Репозитории.ПоследнееОбновление КАК updateddate,
                          | СтатистикаРепозиториевСрезПоследних.ПрошлоеМесто КАК prevPlace
                          |ИЗ
                          | Справочник.Репозитории КАК Репозитории
                          |     ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатистикаРепозиториев КАК СтатистикаРепозиториевСрезПоследних
                          |     ПО (СтатистикаРепозиториевСрезПоследних.Репозиторий = Репозитории.Ссылка)
                          |ГДЕ
                          | НЕ Репозитории.ПометкаУдаления
                          |
                          |УПОРЯДОЧИТЬ ПО
                          | СтатистикаРепозиториевСрезПоследних.Звезды УБЫВ,
                          | СтатистикаРепозиториевСрезПоследних.Форки УБЫВ,
                          | Репозитории.ДатаСоздания");
    
    Результат = Запрос.Выполнить().Выгрузить();   
    Данные = Инструментарий.ТаблицаЗначенийВМассив(Результат);
    Счетчик = 1;
    
    Для Каждого Позиция Из Данные Цикл
        
        Изменение = ?(Позиция.prevPlace = 0, Счетчик, Позиция.prevPlace - Счетчик);

        Динамика  = ?(Изменение < 0, "down","up");
        Динамика  = ?(Изменение = 0, "same", Динамика);
                
        Позиция.Вставить("dynamic" , Динамика);
        Позиция.Вставить("сhanging", Изменение);
        Позиция.Вставить("place"   , Счетчик);
        
        Счетчик = Счетчик + 1;

    КонецЦикла;
    
    Ответ       = Новый HTTPСервисОтвет(200);
         
    ПотокОтвета = Ответ.ПолучитьТелоКакПоток();
    ОтветJSON   = Новый ЗаписьJSON;
    ОтветJSON.ОткрытьПоток(ПотокОтвета, "UTF-8");
    
    НастройкиСериализации = Новый НастройкиСериализацииJSON;
    НастройкиСериализации.ВариантЗаписиДаты      = ВариантЗаписиДатыJSON.УниверсальнаяДата;
    НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
    
    Попытка
        ЗаписатьJSON(ОтветJSON, Данные, НастройкиСериализации);
    Исключение
        ОО = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
    КонецПопытки;
    
    ОтветJSON.Закрыть();
    ПотокОтвета.Закрыть();
    
    Возврат Ответ;
    
КонецФункции

Функция getDataCors(Запрос)
    Ответ = Новый HTTPСервисОтвет(200);
    
    Ответ.Заголовки.Вставить("Access-Control-Allow-Credentials", "true");
    Ответ.Заголовки.Вставить("Access-Control-Allow-Methods", "*");
    Ответ.Заголовки.Вставить("Access-Control-Allow-Headers", "cache-control,expires,pragma,Access-Control-Allow-Headers, Origin,Accept, X-Requested-With, Content-Type, Access-Control-Request-Method, Access-Control-Request-Headers");

    Возврат Ответ;
КонецФункции
