#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьАвторов(Команда)
    ВыгрузитьАвторовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьРепозитории(Команда)
    ВыгрузитьРепозиторииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНовости(Команда)
    ВыгрузитьНовостиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ВыгрузитьАвторовНаСервере()
    Попытка
        МетодыВыгрзкиДанных.ВыгрузитьАвторов();
    Исключение
        //@skip-check use-non-recommended-method
        Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
        ИнструментарийВызовСервера.ЗаписатьИсключение(ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьРепозиторииНаСервере()
    Попытка
        МетодыВыгрзкиДанных.ВыгрузитьРепозитории();
    Исключение
        //@skip-check use-non-recommended-method
        Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
        ИнструментарийВызовСервера.ЗаписатьИсключение(ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьНовостиНаСервере()
    Попытка
        МетодыВыгрзкиДанных.ВыгрузитьНовости();
    Исключение
        //@skip-check use-non-recommended-method
        Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
        ИнструментарийВызовСервера.ЗаписатьИсключение(ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

#КонецОбласти
