&НаСервереБезКонтекста
Процедура СбросДинамикиНаСервере()
	МетодыСайта.ПрописатьМеста();
КонецПроцедуры

&НаКлиенте
Процедура СбросДинамики(Команда)
	СбросДинамикиНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьПоследниеНаСервере()
	МетодыGitHub.ЗагрузитьПоследние();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПоследние(Команда)
	ВыгрузитьПоследниеНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьОбновленныеНаСервере()
	МетодыGitHub.ЗагрузитьОбновленные();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбновленные(Команда)
	ВыгрузитьОбновленныеНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьТопСайтНаСервере()
    МетодыСайта.ОбновитьДанныеСайта();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТопСайт(Команда)
    ВыгрузитьТопСайтНаСервере();
КонецПроцедуры
