
&НаСервереБезКонтекста
Процедура ВыгрузитьNotionНаСервере()
	МетодыNotion.ЗагрузитьНаNotion();	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьNotion(Команда)
	ВыгрузитьNotionНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СбросДинамикиНаСервере()
	МетодыNotion.ПрописатьМеста();
КонецПроцедуры

&НаКлиенте
Процедура СбросДинамики(Команда)
	СбросДинамикиНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьПоследниеНаСервере()
	МетодыGitHub.ЗагрузитьПоследние();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПоследние(Команда)
	ВыгрузитьПоследниеНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьОбновленныеНаСервере()
	МетодыGitHub.ЗагрузитьОбновленные();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбновленные(Команда)
	ВыгрузитьОбновленныеНаСервере();
КонецПроцедуры
