
Процедура ПередЗаписью(Отказ)
	
	Если Не Ссылка.ПометкаУдаления И ПометкаУдаления Тогда
		МетодыВыгрзкиДанных.УдалитьДанныеРепозитория(Ссылка);
	КонецЕсли;
	
	Если Ссылка.ПометкаУдаления И Не ПометкаУдаления Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Посты.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.Посты КАК Посты
		                      |ГДЕ
		                      |	НЕ Посты.ПометкаУдаления
		                      |	И Посты.Репозиторий = &Репозиторий");
		
		Запрос.УстановитьПараметр("Репозиторий", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		МЗаписи = РегистрыСведений.ОчередьВыгрузки.СоздатьМенеджерЗаписи();
		МЗаписи.ОбъектВыгрузки = Ссылка;
		МЗаписи.Записать(Истина);
		
		Пока Выборка.Следующий() Цикл
			
			МЗаписи = РегистрыСведений.ОчередьВыгрузки.СоздатьМенеджерЗаписи();
			МЗаписи.ОбъектВыгрузки = Выборка.Ссылка;
			МЗаписи.Записать(Истина);
			
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
