// Copyright (c) 2023-2025 Anton Tsitavets

// 
// This program is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
// 
// This program is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
// 
// You should have received a copy of the GNU General Public License
// along with this program.  If not, see <https://www.gnu.org/licenses/>.

// https://github.com/OpenBSL/OpenYellow

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьИсключение(Знач ОписаниеОшибки) Экспорт
    
    МЗаписи = РегистрыСведений.Исключения.СоздатьМенеджерЗаписи();
    МЗаписи.Период = ТекущаяДатаСеанса();
    МЗаписи.UID = Строка(Новый УникальныйИдентификатор);
    МЗаписи.ОписаниеОшибки = ОписаниеОшибки;
    МЗаписи.Записать(Истина);
    
КонецПроцедуры

Процедура ЗаписатьФайлВРеквизиты(Знач Путь, Знач СтруктураЗаписи) Экспорт
	
	ФайлДвоичные   = Новый ДвоичныеДанные(Путь);
	РеквизитЗаписи = СтруктураЗаписи["Реквизит"];
	РеквизитПути   = СтруктураЗаписи["Путь"];
	
	ОбъектЗаписи = СтруктураЗаписи["Ссылка"].ПолучитьОбъект();
	ОбъектЗаписи[РеквизитЗаписи] = Новый ХранилищеЗначения(ФайлДвоичные);
	
	Если ЗначениеЗаполнено(РеквизитПути) Тогда
		ОбъектЗаписи[РеквизитПути] = Путь;
	КонецЕсли;
	
	ОбъектЗаписи.Записать();

КонецПроцедуры

Процедура ЗаписатьJSONВФайл(Знач Данные, Знач Путь) Экспорт
    
    JSON = Новый ЗаписьJSON();
    
    Настройки   = Новый НастройкиСериализацииJSON();    
    Настройки.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
    
    ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);

    JSON.ОткрытьФайл(Путь, "UTF-8", , ПараметрыЗаписиJSON);
    
    ЗаписатьJSON(JSON, Данные, Настройки);
    JSON.Закрыть();
    
КонецПроцедуры

Процедура УстановитьНастройку(Имя, Значение) Экспорт
    
    СтрокаПодключения = СтрокаСоединенияИнформационнойБазы();
    
    Набор = Справочники.НаборыНастроек.НайтиПоРеквизиту("СтрокаПодключения", СтрокаПодключения);
    
    НаборОбъект = Набор.ПолучитьОбъект();
    НаборОбъект[Имя] = Значение;
    
    НаборОбъект.Записать();
    
КонецПроцедуры

Функция ПолучитьСписокРепозиториев(Знач Запрос, Знач Страница = 1) Экспорт
    
    URL         = Запрос.Запрос + "+fork:true&page=" + Строка(Страница) + "&visibility=public";
    Авторизация = "token " + ПолучитьНастройку("GitHubToken");
    Заголовки   = Новый Соответствие;
    Заголовки.Вставить("Authorization", Авторизация);
    Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
    
    //@skip-check undefined-variable
    Ответ = OPI_ЗапросыHTTP.Get(URL, , Заголовки);  
    
	Возврат Ответ;
	   
КонецФункции

Функция ПолучитьПоследнийРелиз(Знач Репозиторий) Экспорт
    
    URL = "https://api.github.com/repos/" 
        + Репозиторий.Автор.Наименование 
        + "/" 
        + Репозиторий.Наименование + "/releases/latest";
        
    Авторизация = "token " + ПолучитьНастройку("GithubTokenДополнительный");
    Заголовки   = Новый Соответствие;
    Заголовки.Вставить("Authorization", Авторизация);
    Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
    
    //@skip-check undefined-variable
    Ответ = OPI_ЗапросыHTTP.Get(URL, , Заголовки);
    
	Возврат Ответ;

КонецФункции

Функция ФорматДата(Знач ДатаСтрока) Экспорт
	
	Возврат Дата(СтрЗаменить(Лев(ДатаСтрока, СтрНайти(ДатаСтрока, "T") - 1), "-", ""));
	
КонецФункции

Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт
	
	Массив = Новый Массив();
	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая = Истина;
	КонецЦикла;
	Для Каждого Строка Из ТаблицаЗначений Цикл
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	Возврат Массив;

КонецФункции

Функция ПолучитьНастройку(Имя) Экспорт
	
	СтрокаПодключения = СтрокаСоединенияИнформационнойБазы();
	
	Набор = Справочники.НаборыНастроек.НайтиПоРеквизиту("СтрокаПодключения", СтрокаПодключения);
	Возврат Набор[Имя];
	
КонецФункции

Функция ПолучитьФайл(Имя) Экспорт

    //@skip-check reading-attribute-from-database
    Возврат Справочники.Файлы[Имя].Файл.Получить();
        
КонецФункции

#КонецОбласти
