#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//@skip-check unknown-form-parameter-access
	//@skip-check unknown-form-parameter-access
	Автообновление = Параметры.Автообновление;
	//@skip-check unknown-form-parameter-access
	//@skip-check unknown-form-parameter-access
	ПериодАвтообновления = Параметры.ПериодАвтообновления;
	Если ПериодАвтообновления < 5 Тогда
		ПериодАвтообновления = 5;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Если ПериодАвтообновления < 5 Тогда
		ПериодАвтообновления = 5;
	КонецЕсли;
	Результат = Новый Структура("Автообновление, ПериодАвтообновления", Автообновление, ПериодАвтообновления);
	Закрыть(Результат);
КонецПроцедуры

#КонецОбласти



