
#Область ОбработчикиСобытий

#Если НаСервере Тогда
        
Процедура ПередЗаписью(Отказ)
		    
	Если ОбменДанными.Загрузка Тогда
	    Возврат;
	КонецЕсли;
	    
	Если Не Ссылка.ПометкаУдаления И ПометкаУдаления Тогда
		МетодыВыгрзкиДанных.УдалитьДанныеАвтора(Ссылка);
	КонецЕсли;
	
	Если Ссылка.ПометкаУдаления И Не ПометкаУдаления Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Репозитории.Ссылка КАК Ссылка
		                      |ПОМЕСТИТЬ Репозитории
		                      |ИЗ
		                      |	Справочник.Репозитории КАК Репозитории
		                      |ГДЕ
		                      |	Репозитории.Автор = &Автор
		                      |	И НЕ Репозитории.ПометкаУдаления
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Посты.Ссылка КАК Ссылка
		                      |ПОМЕСТИТЬ Посты
		                      |ИЗ
		                      |	Репозитории КАК Репозитории
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Посты КАК Посты
		                      |		ПО Репозитории.Ссылка = Посты.Репозиторий
		                      |ГДЕ
		                      |	НЕ Посты.ПометкаУдаления");
		
		Запрос.УстановитьПараметр("Автор", Ссылка);
		
		Пакеты      = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		Репозитории = Пакеты[0].Выбрать();
		Посты       = Пакеты[1].Выбрать();
		
		МЗаписи = РегистрыСведений.ОчередьВыгрузки.СоздатьМенеджерЗаписи();
		МЗаписи.ОбъектВыгрузки = Ссылка;
		МЗаписи.Записать(Истина);
		
		Пока Репозитории.Следующий() Цикл
			
			МЗаписи = РегистрыСведений.ОчередьВыгрузки.СоздатьМенеджерЗаписи();
			МЗаписи.ОбъектВыгрузки = Репозитории.Ссылка;
			МЗаписи.Записать(Истина);
			
		КонецЦикла;
		
		Пока Посты.Следующий() Цикл
			
			МЗаписи = РегистрыСведений.ОчередьВыгрузки.СоздатьМенеджерЗаписи();
			МЗаписи.ОбъектВыгрузки = Посты.Ссылка;
			МЗаписи.Записать(Истина);
			
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти
