//@skip-check Undefined variable
    
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСписокРепозиториев(Знач Страница = 1, Знач Запрос) Экспорт
    
    URL         = Запрос.Запрос + "&page=" + Строка(Страница) + "&visibility=public";
    Авторизация = "token " + Константы.GitHubToken.Получить();
    Заголовки   = Новый Соответствие;
    Заголовки.Вставить("Authorization", Авторизация);
    Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
    
    Ответ = OPI_Инструменты.Get(URL, , Заголовки);
    
	Возврат Ответ;
	
КонецФункции

Функция ФорматДата(Знач ДатаСтрока) Экспорт
	
	Возврат Дата(СтрЗаменить(Лев(ДатаСтрока, СтрНайти(ДатаСтрока, "T") - 1), "-", ""));
	
КонецФункции

Процедура ЗаписатьИсключение(Знач ОписаниеОшибки) Экспорт
    
    МЗ = РегистрыСведений.Исключения.СоздатьМенеджерЗаписи();
    МЗ.Период = ТекущаяДатаСеанса();
    МЗ.UID = Строка(Новый УникальныйИдентификатор);
    МЗ.ОписаниеОшибки = ОписаниеОшибки;
    МЗ.Записать(Истина);
    
КонецПроцедуры

#КонецОбласти
